iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct ADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCEN:1;
      uint64_t TMPSPWR:1;
      uint64_t RPTEN:1;
      uint64_t LPMODE:2;
      uint64_t OPMODE:2;
      uint64_t BATTLOAD:1;
      uint64_t REFSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t TRIGSEL:4;
      uint64_t TRIGPOL:1;
      uint64_t reservedSpace1:3;
      uint64_t CLKSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDSTAT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN0:1;
      uint64_t WCEN0:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL0:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL0:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL0CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN1:1;
      uint64_t WCEN1:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL1:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL1:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL1CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN2:1;
      uint64_t WCEN2:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL2:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL2:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL2CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN3:1;
      uint64_t WCEN3:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL3:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL3:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL3CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN4:1;
      uint64_t WCEN4:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL4:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL4:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL4:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL4CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN5:1;
      uint64_t WCEN5:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL5:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL5:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL5:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL5CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN6:1;
      uint64_t WCEN6:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL6:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL6:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL6CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLEN7:1;
      uint64_t WCEN7:1;
      uint64_t reservedSpace0:6;
      uint64_t CHSEL7:4;
      uint64_t reservedSpace1:4;
      uint64_t THSEL7:3;
      uint64_t reservedSpace2:5;
      uint64_t ADSEL7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL7CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LLIM:16;
      uint64_t ULIM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WLIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t COUNT:4;
      uint64_t RSVD_20:4;
      uint64_t SLOTNUM:3;
      uint64_t RSVD_27:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

  uint8_t res0[460];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNVCMP:1;
      uint64_t SCNCMP:1;
      uint64_t FIFOOVR1:1;
      uint64_t FIFOOVR2:1;
      uint64_t WCEXC:1;
      uint64_t WCINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNVCMP:1;
      uint64_t SCNCMP:1;
      uint64_t FIFOOVR1:1;
      uint64_t FIFOOVR2:1;
      uint64_t WCEXC:1;
      uint64_t WCINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNVCMP:1;
      uint64_t SCNCMP:1;
      uint64_t FIFOOVR1:1;
      uint64_t FIFOOVR2:1;
      uint64_t WCEXC:1;
      uint64_t WCINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNVCMP:1;
      uint64_t SCNCMP:1;
      uint64_t FIFOOVR1:1;
      uint64_t FIFOOVR2:1;
      uint64_t WCEXC:1;
      uint64_t WCINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

