iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define ADC (*(volatile struct ADC_tag *) 0x50008000)

struct CTIMER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTTMRA0:16;
      uint64_t CTTMRB0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0A0:16;
      uint64_t CMPR1A0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0B0:16;
      uint64_t CMPR1B0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRA0EN:1;
      uint64_t TMRA0CLK:5;
      uint64_t TMRA0FN:3;
      uint64_t TMRA0IE:1;
      uint64_t TMRA0PE:1;
      uint64_t TMRA0CLR:1;
      uint64_t TMRA0POL:1;
      uint64_t reservedSpace0:3;
      uint64_t TMRB0EN:1;
      uint64_t TMRB0CLK:5;
      uint64_t TMRB0FN:3;
      uint64_t TMRB0IE:1;
      uint64_t TMRB0PE:1;
      uint64_t TMRB0CLR:1;
      uint64_t TMRB0POL:1;
      uint64_t reservedSpace1:2;
      uint64_t CTLINK0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTTMRA1:16;
      uint64_t CTTMRB1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0A1:16;
      uint64_t CMPR1A1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0B1:16;
      uint64_t CMPR1B1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRA1EN:1;
      uint64_t TMRA1CLK:5;
      uint64_t TMRA1FN:3;
      uint64_t TMRA1IE:1;
      uint64_t TMRA1PE:1;
      uint64_t TMRA1CLR:1;
      uint64_t TMRA1POL:1;
      uint64_t reservedSpace0:3;
      uint64_t TMRB1EN:1;
      uint64_t TMRB1CLK:5;
      uint64_t TMRB1FN:3;
      uint64_t TMRB1IE:1;
      uint64_t TMRB1PE:1;
      uint64_t TMRB1CLR:1;
      uint64_t TMRB1POL:1;
      uint64_t reservedSpace1:2;
      uint64_t CTLINK1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTTMRA2:16;
      uint64_t CTTMRB2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0A2:16;
      uint64_t CMPR1A2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0B2:16;
      uint64_t CMPR1B2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRA2EN:1;
      uint64_t TMRA2CLK:5;
      uint64_t TMRA2FN:3;
      uint64_t TMRA2IE:1;
      uint64_t TMRA2PE:1;
      uint64_t TMRA2CLR:1;
      uint64_t TMRA2POL:1;
      uint64_t reservedSpace0:3;
      uint64_t TMRB2EN:1;
      uint64_t TMRB2CLK:5;
      uint64_t TMRB2FN:3;
      uint64_t TMRB2IE:1;
      uint64_t TMRB2PE:1;
      uint64_t TMRB2CLR:1;
      uint64_t TMRB2POL:1;
      uint64_t reservedSpace1:2;
      uint64_t CTLINK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTTMRA3:16;
      uint64_t CTTMRB3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0A3:16;
      uint64_t CMPR1A3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPR0B3:16;
      uint64_t CMPR1B3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPRB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRA3EN:1;
      uint64_t TMRA3CLK:5;
      uint64_t TMRA3FN:3;
      uint64_t TMRA3IE:1;
      uint64_t TMRA3PE:1;
      uint64_t TMRA3CLR:1;
      uint64_t TMRA3POL:1;
      uint64_t reservedSpace0:2;
      uint64_t ADCEN:1;
      uint64_t TMRB3EN:1;
      uint64_t TMRB3CLK:5;
      uint64_t TMRB3FN:3;
      uint64_t TMRB3IE:1;
      uint64_t TMRB3PE:1;
      uint64_t TMRB3CLR:1;
      uint64_t TMRB3POL:1;
      uint64_t reservedSpace1:2;
      uint64_t CTLINK3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL3;

  uint8_t res0[448];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMRA0INT:1;
      uint64_t CTMRB0INT:1;
      uint64_t CTMRA1INT:1;
      uint64_t CTMRB1INT:1;
      uint64_t CTMRA2INT:1;
      uint64_t CTMRB2INT:1;
      uint64_t CTMRA3INT:1;
      uint64_t CTMRB3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMRA0INT:1;
      uint64_t CTMRB0INT:1;
      uint64_t CTMRA1INT:1;
      uint64_t CTMRB1INT:1;
      uint64_t CTMRA2INT:1;
      uint64_t CTMRB2INT:1;
      uint64_t CTMRA3INT:1;
      uint64_t CTMRB3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMRA0INT:1;
      uint64_t CTMRB0INT:1;
      uint64_t CTMRA1INT:1;
      uint64_t CTMRB1INT:1;
      uint64_t CTMRA2INT:1;
      uint64_t CTMRB2INT:1;
      uint64_t CTMRA3INT:1;
      uint64_t CTMRB3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMRA0INT:1;
      uint64_t CTMRB0INT:1;
      uint64_t CTMRA1INT:1;
      uint64_t CTMRB1INT:1;
      uint64_t CTMRA2INT:1;
      uint64_t CTMRB2INT:1;
      uint64_t CTMRA3INT:1;
      uint64_t CTMRB3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

};

#define CTIMER (*(volatile struct CTIMER_tag *) 0x40008000)

struct GPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD0PULL:1;
      uint64_t PAD0INPEN:1;
      uint64_t PAD0STRNG:1;
      uint64_t PAD0FNCSEL:3;
      uint64_t reservedSpace0:2;
      uint64_t PAD1PULL:1;
      uint64_t PAD1INPEN:1;
      uint64_t PAD1STRNG:1;
      uint64_t PAD1FNCSEL:3;
      uint64_t reservedSpace1:2;
      uint64_t PAD2PULL:1;
      uint64_t PAD2INPEN:1;
      uint64_t PAD2STRNG:1;
      uint64_t PAD2FNCSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t PAD3PULL:1;
      uint64_t PAD3INPEN:1;
      uint64_t PAD3STRNG:1;
      uint64_t PAD3FNCSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t PAD3PWRUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD4PULL:1;
      uint64_t PAD4INPEN:1;
      uint64_t PAD4STRNG:1;
      uint64_t PAD4FNCSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t PAD4PWRUP:1;
      uint64_t PAD5PULL:1;
      uint64_t PAD5INPEN:1;
      uint64_t PAD5STRNG:1;
      uint64_t PAD5FNCSEL:3;
      uint64_t PAD5RSEL:2;
      uint64_t PAD6PULL:1;
      uint64_t PAD6INPEN:1;
      uint64_t PAD6STRNG:1;
      uint64_t PAD6FNCSEL:3;
      uint64_t PAD6RSEL:2;
      uint64_t PAD7PULL:1;
      uint64_t PAD7INPEN:1;
      uint64_t PAD7STRNG:1;
      uint64_t PAD7FNCSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD8PULL:1;
      uint64_t PAD8INPEN:1;
      uint64_t PAD8STRNG:1;
      uint64_t PAD8FNCSEL:3;
      uint64_t PAD8RSEL:2;
      uint64_t PAD9PULL:1;
      uint64_t PAD9INPEN:1;
      uint64_t PAD9STRNG:1;
      uint64_t PAD9FNCSEL:3;
      uint64_t PAD9RSEL:2;
      uint64_t PAD10PULL:1;
      uint64_t PAD10INPEN:1;
      uint64_t PAD10STRNG:1;
      uint64_t PAD10FNCSEL:3;
      uint64_t reservedSpace0:2;
      uint64_t PAD11PULL:1;
      uint64_t PAD11INPEN:1;
      uint64_t PAD11STRNG:1;
      uint64_t PAD11FNCSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t PAD11PWRDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD12PULL:1;
      uint64_t PAD12INPEN:1;
      uint64_t PAD12STRNG:1;
      uint64_t PAD12FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD13PULL:1;
      uint64_t PAD13INPEN:1;
      uint64_t PAD13STRNG:1;
      uint64_t PAD13FNCSEL:3;
      uint64_t reservedSpace1:2;
      uint64_t PAD14PULL:1;
      uint64_t PAD14INPEN:1;
      uint64_t PAD14STRNG:1;
      uint64_t PAD14FNCSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t PAD15PULL:1;
      uint64_t PAD15INPEN:1;
      uint64_t PAD15STRNG:1;
      uint64_t PAD15FNCSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD16PULL:1;
      uint64_t PAD16INPEN:1;
      uint64_t PAD16STRNG:1;
      uint64_t PAD16FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD17PULL:1;
      uint64_t PAD17INPEN:1;
      uint64_t PAD17STRNG:1;
      uint64_t PAD17FNCSEL:3;
      uint64_t reservedSpace1:2;
      uint64_t PAD18PULL:1;
      uint64_t PAD18INPEN:1;
      uint64_t PAD18STRNG:1;
      uint64_t PAD18FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD19PULL:1;
      uint64_t PAD19INPEN:1;
      uint64_t PAD19STRNG:1;
      uint64_t PAD19FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD20PULL:1;
      uint64_t PAD20INPEN:1;
      uint64_t PAD20STRNG:1;
      uint64_t PAD20FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD21PULL:1;
      uint64_t PAD21INPEN:1;
      uint64_t PAD21STRNG:1;
      uint64_t PAD21FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD22PULL:1;
      uint64_t PAD22INPEN:1;
      uint64_t PAD22STRNG:1;
      uint64_t PAD22FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD23PULL:1;
      uint64_t PAD23INPEN:1;
      uint64_t PAD23STRNG:1;
      uint64_t PAD23FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD24PULL:1;
      uint64_t PAD24INPEN:1;
      uint64_t PAD24STRNG:1;
      uint64_t PAD24FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD25PULL:1;
      uint64_t PAD25INPEN:1;
      uint64_t PAD25STRNG:1;
      uint64_t PAD25FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD26PULL:1;
      uint64_t PAD26INPEN:1;
      uint64_t PAD26STRNG:1;
      uint64_t PAD26FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD27PULL:1;
      uint64_t PAD27INPEN:1;
      uint64_t PAD27STRNG:1;
      uint64_t PAD27FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD28PULL:1;
      uint64_t PAD28INPEN:1;
      uint64_t PAD28STRNG:1;
      uint64_t PAD28FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD29PULL:1;
      uint64_t PAD29INPEN:1;
      uint64_t PAD29STRNG:1;
      uint64_t PAD29FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD30PULL:1;
      uint64_t PAD30INPEN:1;
      uint64_t PAD30STRNG:1;
      uint64_t PAD30FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD31PULL:1;
      uint64_t PAD31INPEN:1;
      uint64_t PAD31STRNG:1;
      uint64_t PAD31FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD32PULL:1;
      uint64_t PAD32INPEN:1;
      uint64_t PAD32STRNG:1;
      uint64_t PAD32FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD33PULL:1;
      uint64_t PAD33INPEN:1;
      uint64_t PAD33STRNG:1;
      uint64_t PAD33FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD34PULL:1;
      uint64_t PAD34INPEN:1;
      uint64_t PAD34STRNG:1;
      uint64_t PAD34FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD35PULL:1;
      uint64_t PAD35INPEN:1;
      uint64_t PAD35STRNG:1;
      uint64_t PAD35FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD36PULL:1;
      uint64_t PAD36INPEN:1;
      uint64_t PAD36STRNG:1;
      uint64_t PAD36FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD37PULL:1;
      uint64_t PAD37INPEN:1;
      uint64_t PAD37STRNG:1;
      uint64_t PAD37FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD38PULL:1;
      uint64_t PAD38INPEN:1;
      uint64_t PAD38STRNG:1;
      uint64_t PAD38FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD39PULL:1;
      uint64_t PAD39INPEN:1;
      uint64_t PAD39STRNG:1;
      uint64_t PAD39FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD40PULL:1;
      uint64_t PAD40INPEN:1;
      uint64_t PAD40STRNG:1;
      uint64_t PAD40FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD41PULL:1;
      uint64_t PAD41INPEN:1;
      uint64_t PAD41STRNG:1;
      uint64_t PAD41FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD42PULL:1;
      uint64_t PAD42INPEN:1;
      uint64_t PAD42STRNG:1;
      uint64_t PAD42FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD43PULL:1;
      uint64_t PAD43INPEN:1;
      uint64_t PAD43STRNG:1;
      uint64_t PAD43FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD44PULL:1;
      uint64_t PAD44INPEN:1;
      uint64_t PAD44STRNG:1;
      uint64_t PAD44FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD45PULL:1;
      uint64_t PAD45INPEN:1;
      uint64_t PAD45STRNG:1;
      uint64_t PAD45FNCSEL:2;
      uint64_t reservedSpace1:3;
      uint64_t PAD46PULL:1;
      uint64_t PAD46INPEN:1;
      uint64_t PAD46STRNG:1;
      uint64_t PAD46FNCSEL:2;
      uint64_t reservedSpace2:3;
      uint64_t PAD47PULL:1;
      uint64_t PAD47INPEN:1;
      uint64_t PAD47STRNG:1;
      uint64_t PAD47FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD48PULL:1;
      uint64_t PAD48INPEN:1;
      uint64_t PAD48STRNG:1;
      uint64_t PAD48FNCSEL:2;
      uint64_t reservedSpace0:3;
      uint64_t PAD49PULL:1;
      uint64_t PAD49INPEN:1;
      uint64_t PAD49STRNG:1;
      uint64_t PAD49FNCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADREGM;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0INCFG:1;
      uint64_t GPIO0OUTCFG:2;
      uint64_t GPIO0INTD:1;
      uint64_t GPIO1INCFG:1;
      uint64_t GPIO1OUTCFG:2;
      uint64_t GPIO1INTD:1;
      uint64_t GPIO2INCFG:1;
      uint64_t GPIO2OUTCFG:2;
      uint64_t GPIO2INTD:1;
      uint64_t GPIO3INCFG:1;
      uint64_t GPIO3OUTCFG:2;
      uint64_t GPIO3INTD:1;
      uint64_t GPIO4INCFG:1;
      uint64_t GPIO4OUTCFG:2;
      uint64_t GPIO4INTD:1;
      uint64_t GPIO5INCFG:1;
      uint64_t GPIO5OUTCFG:2;
      uint64_t GPIO5INTD:1;
      uint64_t GPIO6INCFG:1;
      uint64_t GPIO6OUTCFG:2;
      uint64_t GPIO6INTD:1;
      uint64_t GPIO7INCFG:1;
      uint64_t GPIO7OUTCFG:2;
      uint64_t GPIO7INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO8INCFG:1;
      uint64_t GPIO8OUTCFG:2;
      uint64_t GPIO8INTD:1;
      uint64_t GPIO9INCFG:1;
      uint64_t GPIO9OUTCFG:2;
      uint64_t GPIO9INTD:1;
      uint64_t GPIO10INCFG:1;
      uint64_t GPIO10OUTCFG:2;
      uint64_t GPIO10INTD:1;
      uint64_t GPIO11INCFG:1;
      uint64_t GPIO11OUTCFG:2;
      uint64_t GPIO11INTD:1;
      uint64_t GPIO12INCFG:1;
      uint64_t GPIO12OUTCFG:2;
      uint64_t GPIO12INTD:1;
      uint64_t GPIO13INCFG:1;
      uint64_t GPIO13OUTCFG:2;
      uint64_t GPIO13INTD:1;
      uint64_t GPIO14INCFG:1;
      uint64_t GPIO14OUTCFG:2;
      uint64_t GPIO14INTD:1;
      uint64_t GPIO15INCFG:1;
      uint64_t GPIO15OUTCFG:2;
      uint64_t GPIO15INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO16INCFG:1;
      uint64_t GPIO16OUTCFG:2;
      uint64_t GPIO16INTD:1;
      uint64_t GPIO17INCFG:1;
      uint64_t GPIO17OUTCFG:2;
      uint64_t GPIO17INTD:1;
      uint64_t GPIO18INCFG:1;
      uint64_t GPIO18OUTCFG:2;
      uint64_t GPIO18INTD:1;
      uint64_t GPIO19INCFG:1;
      uint64_t GPIO19OUTCFG:2;
      uint64_t GPIO19INTD:1;
      uint64_t GPIO20INCFG:1;
      uint64_t GPIO20OUTCFG:2;
      uint64_t GPIO20INTD:1;
      uint64_t GPIO21INCFG:1;
      uint64_t GPIO21OUTCFG:2;
      uint64_t GPIO21INTD:1;
      uint64_t GPIO22INCFG:1;
      uint64_t GPIO22OUTCFG:2;
      uint64_t GPIO22INTD:1;
      uint64_t GPIO23INCFG:1;
      uint64_t GPIO23OUTCFG:2;
      uint64_t GPIO23INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO24INCFG:1;
      uint64_t GPIO24OUTCFG:2;
      uint64_t GPIO24INTD:1;
      uint64_t GPIO25INCFG:1;
      uint64_t GPIO25OUTCFG:2;
      uint64_t GPIO25INTD:1;
      uint64_t GPIO26INCFG:1;
      uint64_t GPIO26OUTCFG:2;
      uint64_t GPIO26INTD:1;
      uint64_t GPIO27INCFG:1;
      uint64_t GPIO27OUTCFG:2;
      uint64_t GPIO27INTD:1;
      uint64_t GPIO28INCFG:1;
      uint64_t GPIO28OUTCFG:2;
      uint64_t GPIO28INTD:1;
      uint64_t GPIO29INCFG:1;
      uint64_t GPIO29OUTCFG:2;
      uint64_t GPIO29INTD:1;
      uint64_t GPIO30INCFG:1;
      uint64_t GPIO30OUTCFG:2;
      uint64_t GPIO30INTD:1;
      uint64_t GPIO31INCFG:1;
      uint64_t GPIO31OUTCFG:2;
      uint64_t GPIO31INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO32INCFG:1;
      uint64_t GPIO32OUTCFG:2;
      uint64_t GPIO32INTD:1;
      uint64_t GPIO33INCFG:1;
      uint64_t GPIO33OUTCFG:2;
      uint64_t GPIO33INTD:1;
      uint64_t GPIO34INCFG:1;
      uint64_t GPIO34OUTCFG:2;
      uint64_t GPIO34INTD:1;
      uint64_t GPIO35INCFG:1;
      uint64_t GPIO35OUTCFG:2;
      uint64_t GPIO35INTD:1;
      uint64_t GPIO36INCFG:1;
      uint64_t GPIO36OUTCFG:2;
      uint64_t GPIO36INTD:1;
      uint64_t GPIO37INCFG:1;
      uint64_t GPIO37OUTCFG:2;
      uint64_t GPIO37INTD:1;
      uint64_t GPIO38INCFG:1;
      uint64_t GPIO38OUTCFG:2;
      uint64_t GPIO38INTD:1;
      uint64_t GPIO39INCFG:1;
      uint64_t GPIO39OUTCFG:2;
      uint64_t GPIO39INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO40INCFG:1;
      uint64_t GPIO40OUTCFG:2;
      uint64_t GPIO40INTD:1;
      uint64_t GPIO41INCFG:1;
      uint64_t GPIO41OUTCFG:2;
      uint64_t GPIO41INTD:1;
      uint64_t GPIO42INCFG:1;
      uint64_t GPIO42OUTCFG:2;
      uint64_t GPIO42INTD:1;
      uint64_t GPIO43INCFG:1;
      uint64_t GPIO43OUTCFG:2;
      uint64_t GPIO43INTD:1;
      uint64_t GPIO44INCFG:1;
      uint64_t GPIO44OUTCFG:2;
      uint64_t GPIO44INTD:1;
      uint64_t GPIO45INCFG:1;
      uint64_t GPIO45OUTCFG:2;
      uint64_t GPIO45INTD:1;
      uint64_t GPIO46INCFG:1;
      uint64_t GPIO46OUTCFG:2;
      uint64_t GPIO46INTD:1;
      uint64_t GPIO47INCFG:1;
      uint64_t GPIO47OUTCFG:2;
      uint64_t GPIO47INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO48INCFG:1;
      uint64_t GPIO48OUTCFG:2;
      uint64_t GPIO48INTD:1;
      uint64_t GPIO49INCFG:1;
      uint64_t GPIO49OUTCFG:2;
      uint64_t GPIO49INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGG;

