iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADKEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADKEY;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTSA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTSB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTCA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTCB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENSA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENSB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENSB;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENCA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCB:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENCB;

  uint8_t res4[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
      uint64_t GPIO6:1;
      uint64_t GPIO7:1;
      uint64_t GPIO8:1;
      uint64_t GPIO9:1;
      uint64_t GPIO10:1;
      uint64_t GPIO11:1;
      uint64_t GPIO12:1;
      uint64_t GPIO13:1;
      uint64_t GPIO14:1;
      uint64_t GPIO15:1;
      uint64_t GPIO16:1;
      uint64_t GPIO17:1;
      uint64_t GPIO18:1;
      uint64_t GPIO19:1;
      uint64_t GPIO20:1;
      uint64_t GPIO21:1;
      uint64_t GPIO22:1;
      uint64_t GPIO23:1;
      uint64_t GPIO24:1;
      uint64_t GPIO25:1;
      uint64_t GPIO26:1;
      uint64_t GPIO27:1;
      uint64_t GPIO28:1;
      uint64_t GPIO29:1;
      uint64_t GPIO30:1;
      uint64_t GPIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT0EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
      uint64_t GPIO6:1;
      uint64_t GPIO7:1;
      uint64_t GPIO8:1;
      uint64_t GPIO9:1;
      uint64_t GPIO10:1;
      uint64_t GPIO11:1;
      uint64_t GPIO12:1;
      uint64_t GPIO13:1;
      uint64_t GPIO14:1;
      uint64_t GPIO15:1;
      uint64_t GPIO16:1;
      uint64_t GPIO17:1;
      uint64_t GPIO18:1;
      uint64_t GPIO19:1;
      uint64_t GPIO20:1;
      uint64_t GPIO21:1;
      uint64_t GPIO22:1;
      uint64_t GPIO23:1;
      uint64_t GPIO24:1;
      uint64_t GPIO25:1;
      uint64_t GPIO26:1;
      uint64_t GPIO27:1;
      uint64_t GPIO28:1;
      uint64_t GPIO29:1;
      uint64_t GPIO30:1;
      uint64_t GPIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT0STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
      uint64_t GPIO6:1;
      uint64_t GPIO7:1;
      uint64_t GPIO8:1;
      uint64_t GPIO9:1;
      uint64_t GPIO10:1;
      uint64_t GPIO11:1;
      uint64_t GPIO12:1;
      uint64_t GPIO13:1;
      uint64_t GPIO14:1;
      uint64_t GPIO15:1;
      uint64_t GPIO16:1;
      uint64_t GPIO17:1;
      uint64_t GPIO18:1;
      uint64_t GPIO19:1;
      uint64_t GPIO20:1;
      uint64_t GPIO21:1;
      uint64_t GPIO22:1;
      uint64_t GPIO23:1;
      uint64_t GPIO24:1;
      uint64_t GPIO25:1;
      uint64_t GPIO26:1;
      uint64_t GPIO27:1;
      uint64_t GPIO28:1;
      uint64_t GPIO29:1;
      uint64_t GPIO30:1;
      uint64_t GPIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT0CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
      uint64_t GPIO6:1;
      uint64_t GPIO7:1;
      uint64_t GPIO8:1;
      uint64_t GPIO9:1;
      uint64_t GPIO10:1;
      uint64_t GPIO11:1;
      uint64_t GPIO12:1;
      uint64_t GPIO13:1;
      uint64_t GPIO14:1;
      uint64_t GPIO15:1;
      uint64_t GPIO16:1;
      uint64_t GPIO17:1;
      uint64_t GPIO18:1;
      uint64_t GPIO19:1;
      uint64_t GPIO20:1;
      uint64_t GPIO21:1;
      uint64_t GPIO22:1;
      uint64_t GPIO23:1;
      uint64_t GPIO24:1;
      uint64_t GPIO25:1;
      uint64_t GPIO26:1;
      uint64_t GPIO27:1;
      uint64_t GPIO28:1;
      uint64_t GPIO29:1;
      uint64_t GPIO30:1;
      uint64_t GPIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT0SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO32:1;
      uint64_t GPIO33:1;
      uint64_t GPIO34:1;
      uint64_t GPIO35:1;
      uint64_t GPIO36:1;
      uint64_t GPIO37:1;
      uint64_t GPIO38:1;
      uint64_t GPIO39:1;
      uint64_t GPIO40:1;
      uint64_t GPIO41:1;
      uint64_t GPIO42:1;
      uint64_t GPIO43:1;
      uint64_t GPIO44:1;
      uint64_t GPIO45:1;
      uint64_t GPIO46:1;
      uint64_t GPIO47:1;
      uint64_t GPIO48:1;
      uint64_t GPIO49:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT1EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO32:1;
      uint64_t GPIO33:1;
      uint64_t GPIO34:1;
      uint64_t GPIO35:1;
      uint64_t GPIO36:1;
      uint64_t GPIO37:1;
      uint64_t GPIO38:1;
      uint64_t GPIO39:1;
      uint64_t GPIO40:1;
      uint64_t GPIO41:1;
      uint64_t GPIO42:1;
      uint64_t GPIO43:1;
      uint64_t GPIO44:1;
      uint64_t GPIO45:1;
      uint64_t GPIO46:1;
      uint64_t GPIO47:1;
      uint64_t GPIO48:1;
      uint64_t GPIO49:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT1STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO32:1;
      uint64_t GPIO33:1;
      uint64_t GPIO34:1;
      uint64_t GPIO35:1;
      uint64_t GPIO36:1;
      uint64_t GPIO37:1;
      uint64_t GPIO38:1;
      uint64_t GPIO39:1;
      uint64_t GPIO40:1;
      uint64_t GPIO41:1;
      uint64_t GPIO42:1;
      uint64_t GPIO43:1;
      uint64_t GPIO44:1;
      uint64_t GPIO45:1;
      uint64_t GPIO46:1;
      uint64_t GPIO47:1;
      uint64_t GPIO48:1;
      uint64_t GPIO49:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT1CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO32:1;
      uint64_t GPIO33:1;
      uint64_t GPIO34:1;
      uint64_t GPIO35:1;
      uint64_t GPIO36:1;
      uint64_t GPIO37:1;
      uint64_t GPIO38:1;
      uint64_t GPIO39:1;
      uint64_t GPIO40:1;
      uint64_t GPIO41:1;
      uint64_t GPIO42:1;
      uint64_t GPIO43:1;
      uint64_t GPIO44:1;
      uint64_t GPIO45:1;
      uint64_t GPIO46:1;
      uint64_t GPIO47:1;
      uint64_t GPIO48:1;
      uint64_t GPIO49:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT1SET;

