iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define GPIO (*(volatile struct GPIO_tag *) 0x40010000)

struct IOMSTR0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOSIZ:7;
      uint64_t reservedSpace0:9;
      uint64_t FIFOREM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLNGTH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TLNGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFORTHR:6;
      uint64_t reservedSpace0:2;
      uint64_t FIFOWTHR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FSEL:3;
      uint64_t DIV3:1;
      uint64_t DIVEN:1;
      uint64_t reservedSpace1:3;
      uint64_t LOWPER:8;
      uint64_t TOTPER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRPT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDRPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t CMDACT:1;
      uint64_t IDLEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCSEL:1;
      uint64_t SPOL:1;
      uint64_t SPHA:1;
      uint64_t reservedSpace0:28;
      uint64_t IFCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res1[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

};

#define IOMSTR0 (*(volatile struct IOMSTR0_tag *) 0x50004000)

struct IOMSTR1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOSIZ:7;
      uint64_t reservedSpace0:9;
      uint64_t FIFOREM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLNGTH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TLNGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFORTHR:6;
      uint64_t reservedSpace0:2;
      uint64_t FIFOWTHR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FSEL:3;
      uint64_t DIV3:1;
      uint64_t DIVEN:1;
      uint64_t reservedSpace1:3;
      uint64_t LOWPER:8;
      uint64_t TOTPER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRPT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDRPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t CMDACT:1;
      uint64_t IDLEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCSEL:1;
      uint64_t SPOL:1;
      uint64_t SPHA:1;
      uint64_t reservedSpace0:28;
      uint64_t IFCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res1[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCMP:1;
      uint64_t THR:1;
      uint64_t FUNDFL:1;
      uint64_t FOVFL:1;
      uint64_t NAK:1;
      uint64_t WTLEN:1;
      uint64_t IACC:1;
      uint64_t ICMD:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ARB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

