iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define IOMSTR1 (*(volatile struct IOMSTR1_tag *) 0x50005000)

struct IOSLAVE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOPTR:8;
      uint64_t FIFOSIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOBASE:5;
      uint64_t reservedSpace0:3;
      uint64_t FIFOMAX:6;
      uint64_t reservedSpace1:10;
      uint64_t ROBASE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOTHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOUPD:1;
      uint64_t IOREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOCTR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOINC:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCSEL:1;
      uint64_t SPOL:1;
      uint64_t LSB:1;
      uint64_t reservedSpace0:1;
      uint64_t STARTRD:1;
      uint64_t reservedSpace1:3;
      uint64_t I2CADDR:12;
      uint64_t reservedSpace2:11;
      uint64_t IFCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRENC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRENC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOINTEN:8;
      uint64_t IOINT:8;
      uint64_t IOINTCLR:1;
      uint64_t reservedSpace0:7;
      uint64_t IOINTSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOINTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GENADD;

  uint8_t res0[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSIZE:1;
      uint64_t FOVFL:1;
      uint64_t FUNDFL:1;
      uint64_t FRDERR:1;
      uint64_t GENAD:1;
      uint64_t IOINTW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSIZE:1;
      uint64_t FOVFL:1;
      uint64_t FUNDFL:1;
      uint64_t FRDERR:1;
      uint64_t GENAD:1;
      uint64_t IOINTW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSIZE:1;
      uint64_t FOVFL:1;
      uint64_t FUNDFL:1;
      uint64_t FRDERR:1;
      uint64_t GENAD:1;
      uint64_t IOINTW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSIZE:1;
      uint64_t FOVFL:1;
      uint64_t FUNDFL:1;
      uint64_t FRDERR:1;
      uint64_t GENAD:1;
      uint64_t IOINTW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGACC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGACCINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGACC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGACCINTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGACC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGACCINTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGACC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REGACCINTSET;

};

#define IOSLAVE (*(volatile struct IOSLAVE_tag *) 0x50000100)

struct MCUCTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUAL:1;
      uint64_t TEMP:2;
      uint64_t PINS:3;
      uint64_t PKG:2;
      uint64_t MINORREV:4;
      uint64_t MAJORREV:4;
      uint64_t RAM:4;
      uint64_t FLASH:4;
      uint64_t CLASS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVISION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIPREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMBUCKEN:1;
      uint64_t COREBUCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPPLYSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMBUCKON:1;
      uint64_t COREBUCKON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPPLYSTATUS;

  uint8_t res0[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BGPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BANDGAPEN;

  uint8_t res1[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK0:1;
      uint64_t BANK1:1;
      uint64_t BANK2:1;
      uint64_t BANK3:1;
      uint64_t BANK4:1;
      uint64_t BANK5:1;
      uint64_t BANK6:1;
      uint64_t BANK7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMPWDINSLEEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK0:1;
      uint64_t BANK1:1;
      uint64_t BANK2:1;
      uint64_t BANK3:1;
      uint64_t BANK4:1;
      uint64_t BANK5:1;
      uint64_t BANK6:1;
      uint64_t BANK7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMPWRDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK0:1;
      uint64_t BANK1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHPWRDIS;

  uint8_t res2[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICODEFAULTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCODEFAULTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSFAULTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICODE:1;
      uint64_t DCODE:1;
      uint64_t SYS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAULTSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAULTCAPTUREEN;

  uint8_t res3[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:7;
      uint64_t CLKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPIUCTRL;

