iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define MCUCTRL (*(volatile struct MCUCTRL_tag *) 0x40020000)

struct RSTGEN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODHREN:1;
      uint64_t WDREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWPOIKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWPOI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWPORKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWPOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXRSTAT:1;
      uint64_t PORSTAT:1;
      uint64_t BORSTAT:1;
      uint64_t SWRSTAT:1;
      uint64_t POIRSTAT:1;
      uint64_t DBGRSTAT:1;
      uint64_t WDRSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLRSTAT;

  uint8_t res0[492];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

};

#define RSTGEN (*(volatile struct RSTGEN_tag *) 0x40000000)

struct UART_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t FEDATA:1;
      uint64_t PEDATA:1;
      uint64_t BEDATA:1;
      uint64_t OEDATA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FESTAT:1;
      uint64_t PESTAT:1;
      uint64_t BESTAT:1;
      uint64_t OESTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTS:1;
      uint64_t DSR:1;
      uint64_t DCD:1;
      uint64_t BUSY:1;
      uint64_t RXFE:1;
      uint64_t TXFF:1;
      uint64_t RXFF:1;
      uint64_t TXFE:1;
      uint64_t RI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILPDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVINT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IBRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVFRAC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRK:1;
      uint64_t PEN:1;
      uint64_t EPS:1;
      uint64_t STP2:1;
      uint64_t FEN:1;
      uint64_t WLEN:2;
      uint64_t SPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTEN:1;
      uint64_t SIREN:1;
      uint64_t SIRLP:1;
      uint64_t CLKEN:1;
      uint64_t CLKSEL:3;
      uint64_t LBE:1;
      uint64_t TXE:1;
      uint64_t RXE:1;
      uint64_t DTR:1;
      uint64_t RTS:1;
      uint64_t OUT1:1;
      uint64_t OUT2:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIFLSEL:3;
      uint64_t RXIFLSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMIM:1;
      uint64_t CTSMIM:1;
      uint64_t DCDMIM:1;
      uint64_t DSRMIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t RTIM:1;
      uint64_t FEIM:1;
      uint64_t PEIM:1;
      uint64_t BEIM:1;
      uint64_t OEIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMRIS:1;
      uint64_t CTSMRIS:1;
      uint64_t DCDMRIS:1;
      uint64_t DSRMRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t RTRIS:1;
      uint64_t FERIS:1;
      uint64_t PERIS:1;
      uint64_t BERIS:1;
      uint64_t OERIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMMIS:1;
      uint64_t CTSMMIS:1;
      uint64_t DCDMMIS:1;
      uint64_t DSRMMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t RTMIS:1;
      uint64_t FEMIS:1;
      uint64_t PEMIS:1;
      uint64_t BEMIS:1;
      uint64_t OEMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMIC:1;
      uint64_t CTSMIC:1;
      uint64_t DCDMIC:1;
      uint64_t DSRMIC:1;
      uint64_t RXIC:1;
      uint64_t TXIC:1;
      uint64_t RTIC:1;
      uint64_t FEIC:1;
      uint64_t PEIC:1;
      uint64_t BEIC:1;
      uint64_t OEIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEC;

};

#define UART (*(volatile struct UART_tag *) 0x4001c000)

struct VCOMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t NSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t LVLSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPOUT:1;
      uint64_t PWDSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDKEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWDKEY;

  uint8_t res0[500];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLOW:1;
      uint64_t OUTHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLOW:1;
      uint64_t OUTHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLOW:1;
      uint64_t OUTHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLOW:1;
      uint64_t OUTHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

