iSYSTEMLabs/winIDEAExampleWorkspaces/Ambiq/APOLLO512/emptyTargetInit/APOLLO512_sfr.h
};

#define VCOMP (*(volatile struct VCOMP_tag *) 0x4000c000)

struct WDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTEN:1;
      uint64_t INTEN:1;
      uint64_t RESEN:1;
      uint64_t reservedSpace0:5;
      uint64_t RESVAL:8;
      uint64_t INTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTRT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  uint8_t res0[500];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

};

#define WDT (*(volatile struct WDT_tag *) 0x40024000)

struct CLKGEN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALXT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALRC:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACALCTR:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACALCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOPXT:1;
      uint64_t STOPRC:1;
      uint64_t reservedSpace0:4;
      uint64_t FOS:1;
      uint64_t OSEL:1;
      uint64_t ACAL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKSEL:6;
      uint64_t reservedSpace0:1;
      uint64_t CKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKKEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORESEL:3;
      uint64_t MEMSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OMODE:1;
      uint64_t OSCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFADJEN:1;
      uint64_t HFADJCK:3;
      uint64_t reservedSpace0:4;
      uint64_t HFXTADJ:11;
      uint64_t HFWARMUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFADJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFTUNERB:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLOCKEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLOCKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTEN;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR100:8;
      uint64_t CTRSEC:7;
      uint64_t reservedSpace0:1;
      uint64_t CTRMIN:7;
      uint64_t reservedSpace1:1;
      uint64_t CTRHR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRLOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRDATE:6;
      uint64_t reservedSpace0:2;
      uint64_t CTRMO:5;
      uint64_t reservedSpace1:3;
      uint64_t CTRYR:8;
      uint64_t CTRWKDY:3;
      uint64_t CB:1;
      uint64_t CEB:1;
      uint64_t reservedSpace2:2;
      uint64_t CTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALM100:8;
      uint64_t ALMSEC:7;
      uint64_t reservedSpace0:1;
      uint64_t ALMMIN:7;
      uint64_t reservedSpace1:1;
      uint64_t ALMHR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALMLOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMDATE:6;
      uint64_t reservedSpace0:2;
      uint64_t ALMMO:5;
      uint64_t reservedSpace1:3;
      uint64_t ALMWKDY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALMUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRTC:1;
      uint64_t RPT:3;
      uint64_t RSTOP:1;
      uint64_t HR1224:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCCTL;

  uint8_t res1[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF:1;
      uint64_t ACC:1;
      uint64_t OF:1;
      uint64_t ALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF:1;
      uint64_t ACC:1;
      uint64_t OF:1;
      uint64_t ALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF:1;
      uint64_t ACC:1;
      uint64_t OF:1;
      uint64_t ALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF:1;
      uint64_t ACC:1;
      uint64_t OF:1;
      uint64_t ALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

};

#define CLKGEN (*(volatile struct CLKGEN_tag *) 0x40004000)

